[
  {
    "id": 1,
    "category": "Sad",
    "para": 24,
    "Ayatno": 53,
    "Surahno": 39,
    "surah": "Az-Zumar",
    "ayat": "۞ قُلْ يَـٰعِبَادِىَ ٱلَّذِينَ أَسْرَفُوا۟ عَلَىٰٓ أَنفُسِهِمْ لَا تَقْنَطُوا۟ مِن رَّحْمَةِ ٱللَّهِ ۚ إِنَّ ٱللَّهَ يَغْفِرُ ٱلذُّنُوبَ جَمِيعًا ۚ إِنَّهُۥ هُوَ ٱلْغَفُورُ ٱلرَّحِيمُ ٥٣",
    "translation_eng":"Say: O My servants who have wronged themselves! Do not lose hope in Allah's mercy. Surely, Allah forgives all sins. Indeed, He is the Most Forgiving, the Most Merciful.",
    "translation_urdu": "کہہ دو: اے میرے بندو! جنہوں نے اپنی جانوں پر زیادتی کی ہے، اللہ کی رحمت سے مایوس نہ ہو، بے شک اللہ سب گناہ معاف کر دیتا ہے، وہ بے شک بخشنے والا اور مہربان ہے۔"
  },
  {
    "id": 2,
    "category": "Sad",
    "para": 4,
    "Ayatno": 139,
    "Surahno": 3,
    "surah": "Al-Imran",
    "ayat": "وَلَا تَهِنُوا۟ وَلَا تَحْزَنُوا۟ وَأَنتُمُ ٱلْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ ",
    "translation_eng":"And do not be weak, and do not be sad. You will surely be victorious if you are true believers.",
    "translation_urdu":"اور نہ  کمزور  بنو اور نہ  غم  کرو اور تم ہی  غالب رہو گے اگر تم مومن ہو ۔"
  },
  {
    "id": 3,
    "category": "Sad",
    "AYATnotmatch": "",
    "para": 13,
    "Ayatno": 87,
    "Surahno": 12,
    "surah": "Al-Yousuf",
    "ayat": "إِنَّهُ لَا يَيْئَسُ مِن رَّوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ",
    "translation_eng": "And do not lose hope in Allah’s mercy. Surely, only disbelievers lose hope in Allah’s mercy.",
    "translation_urdu":"اور اللہ کی رحمت سے ناامید نہ ہو ۔  یقین  جانو ، اللہ کی رحمت سے وہی لوگ نا  امید  ہوتے ہیں جو کافر ہیں ۔"
  },
  {
    "id": 4,
    "category": "Sad",
    "para": 4,
    "AYATnotmatch": "",
    "Ayatno": 122,
    "Surahno": 3,
    "surah": "Al-Imran",
    "ayat": "وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ ٥١",
    "translation_eng": "And the believers should put their trust in Allah alone.",
    "translation_urdu": "اور مومنوں کو اللہ ہی پر بھروسہ رکھنا چاہئے ۔"
  },
  {
    "id": 5,
    "category": "Sad",
    "para": 14,
    "Ayatno": 97,
    "Surahno": 15,
    "surah": "Al-Hajr",
    "ayat": "وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ",
    "translation_eng":"And We know that what they say makes your heart feel distressed.",
    "translation_urdu": "اور ہم کو معلوم ہے کہ جو کچھ وہ کہتے ہیں ، اس سے تمہارا  دل   تنگ  ہوتا ہے ۔"
  },
  {
    "id": 6,
    "category": "Sad",
    "para": 9,
    "surah": "Al-A’raf",
    "Ayatno": 205,
    "Surahno": 7,
    "ayat": "وَٱذْكُر رَّبَّكَ فِى نَفْسِكَ تَضَرُّعًۭا وَخِيفَةًۭ وَدُونَ ٱلْجَهْرِ مِنَ ٱلْقَوْلِ بِٱلْغُدُوِّ وَٱلْـَٔاصَالِ وَلَا تَكُن مِّنَ ٱلْغَـٰفِلِينَ ٢٠٥ ",
    "translation_eng": "And remember your Lord morning and evening in your heart, with humility and fear, and in a low voice. And do not be among the heedless.",
    "translation_urdu": "اور اپنے رب کو صبح وشام  یاد  کرو اپنے  دل  میں ،  عاجزی  اور خوف کے ساتھ اور پست  آواز  سے اور غافلوں میں سے نہ بنو۔"
  },
  {
    "id": 7,
    "category": "Anxious",
    "para": 13,
    "Ayatno": 28,
    "Surahno": 13,
    "surah": "Ar-Ra’d ",
    "ayat": "ٱلَّذِينَ ءَامَنُوا۟ وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ ٱللَّهِ ۗ أَلَا بِذِكْرِ ٱللَّهِ تَطْمَئِنُّ ٱلْقُلُوبُ ٢٨",
    "translation_eng": "Those who believe and find peace in the remembrance of Allah—listen! Only in the remembrance of Allah do hearts find peace.",
    "translation_urdu": "وہ جو ایمان لائے اور ان کے  دل  اللہ کی  یاد  سے چین پاتے ہیں ، سن لو اللہ کی  یاد  ہی میں دلوں کا چین ہے"
  },
  {
    "id": 8,
    "category": "Anxious",
    "para": 3,
    "AYATnotmatch": "",
    "surah": "Ar-Imran",
    "Ayatno": 173,
    "Surahno": 3,
    "ayat":" وَقَالُوا۟ حَسْبُنَا ٱللَّهُ وَنِعْمَ ٱلْوَكِيلُ ١٧٣",
    "translation_eng": "Allah is sufficient for us, and He is the best disposer of affairs.",
    "translation_urdu": "اللہ ہمارے لیے کافی ہے اور وہ بہترین کارساز ہے۔"
  },
  {
    "id": 9,
    "category": "Anxious",
    "para": 10,
    "AYATnotmatch": "",
    "Ayatno": 40,
    "Surahno": 9,
    "surah": "At-Toba",
    "ayat": "۞ لَا تَحْزَنْ إِنَّ ٱللَّهَ مَعَنَا ۖ",
    "translation_eng": "Do not worry; Allah is certainly with us.",
    "translation_urdu": "غم نہ کھا، بے شک اللہ ہمارے ساتھ ہے۔"
  },
  {
    "id": 10,
    "category": "Anxious",
    "para": 10,
    "AYATnotmatch": "",
    "Ayatno": 46,
    "Surahno": 8,
    "surah": "Al-Anfal",
    "ayat": "وَاصْبِرُوا إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
    "translation_eng": " Persevere! Surely Allah is with those who persevere.",
    "translation_urdu": "اور صبر کرو، بے شک اللہ صبر کرنے والوں کے ساتھ ہے۔"
  },
  {
    "id": 11,
    "category": "Anxious",
    "para": 30,
    "Ayatno": 5,
    "Surahno": 94,
    "surah": "Ash-Sharh",
    "ayat": "۞ فَإِنَّ مَعَ ٱلْعُسْرِ يُسْرًا ",
    "translation_eng": "Surely, with every hardship comes ease.",
    "translation_urdu": "بے شک ہر مشکل کے بعد آسانی ہے "
  },
  {
    "id": 12,
    "category": "Anxious",
    "para": 3,
    "AYATnotmatch": "",
    "Ayatno": 286,
    "Surahno": 2,
    "surah": "Al-Baqarah",
    "ayat": "۞ لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ",
    "translation_eng": "Allah does not require of any soul more than what it can afford.",
    "translation_urdu": "اللہ کسی جان پر بوجھ نہیں ڈالتا مگر اس کی طاقت کے مطابق"
  },
  {
    "id": 13,
    "category": "Anxious",
    "para": 28,
    "Ayatno": 3,
    "Surahno": 65,
    "surah": "At-Talaq",
    "ayat":" وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَن يَتَوَكَّلْ عَلَى ٱللَّهِ فَهُوَ حَسْبُهُۥٓ ۚ إِنَّ ٱللَّهَ بَـٰلِغُ أَمْرِهِۦ ۚ قَدْ جَعَلَ ٱللَّهُ لِكُلِّ شَىْءٍۢ قَدْرًۭا ٣",
    "translation_eng":"Allah provides for him from where he does not even expect. And whoever puts his trust in Allah, He is sufficient for him. Surely, Allah will accomplish His command. Indeed, Allah has set a measure for everything.",
    "translation_urdu": "اللہ اسے ایسی  جگہ  سے روزی دیتا ہے جس کا اسے  گمان  بھی نہ ہو اور جو شخص اللہ پر توکل کرے گا اللہ اسے  کافی  ہوگا ۔ اللہ تعالٰی اپنا  کام  پورا کر کے ہی رہے گا اللہ تعالٰی نے ہرچیز کا ایک  اندازہ   مقرر  کر رکھا ہے ۔"
  },
  {
    "id": 14,
    "category": "Anxious",
    "para": 14,
    "surah": "An-Nahl",
    "Ayatno": 127,
    "Surahno": 16,
    "ayat": "وَاصْبِرْ وَمَا صَبْرُكَ إِلَّا بِاللَّهِ ۚ وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُ فِي ضِيقٍ مِّمَّا يَمْكُرُونَ",
    "translation_eng": "And be patient, for your patience is only with Allah’s help. And do not grieve over their plots, nor let your heart feel distressed.",
    "translation_urdu": "اور صبر کرو، اور تمہارا صبر صرف اللہ کی مدد سے ہے، اور ان لوگوں کی سازشوں پر غم نہ کرو اور نہ ہی دل تنگ کرو۔"
  },
  {
    "id": 15,
    "category": "Anxious",
    "para": 11,
    "Ayatno": 51,
    "Surahno": 9,
    "surah": "At-Toba",
    "ayat": "۞قُل لَّن يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا هُوَ مَوْلَانَا وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ",
    "translation_eng": "Say: Nothing will befall us except what Allah has decreed for us. He is our protector, and upon Allah alone should the believers rely.",
    "translation_urdu": "کہہ دو کہ : اللہ نے ہمارے مقدر میں جو  تکلیف  لکھ دی ہے ، ہمیں اس کے سوا کوئی اور  تکلیف  ہرگز نہیں پہنچ سکتی ۔ وہ ہمارا رکھوالا ہے ، اور اللہ ہی پر مومنوں کو بھروسہ رکھنا چاہیے ۔"
  },
  {
    "id": 16,
    "category": "Angry",
    "para": 8,
    "Ayatno": 199,
    "Surahno": 7,
    "surah": "Al-A'raf",
    "ayat": "خُذِ ٱلْعَفْوَ وَأْمُرْ بِٱلْعُرْفِ وَأَعْرِضْ عَنِ ٱلْجَـٰهِلِينَ ١٩٩",
    "translation_eng":"Forgive, encourage what is good, and turn away from the ignorant.",
    "translation_urdu": "درگذر کرو ،  نیکی  کا  حکم  دو اور جاہلوں سے ایک  کنارہ  ہوجائیں"
  },
  {
    "id": 17,
    "category": "Angry",
    "para": 3,
    "Ayatno": 134,
    "Surahno": 3,
    "surah": "Al-Imran",
    "ayat":" ٱلَّذِينَ يُنفِقُونَ فِى ٱلسَّرَّآءِ وَٱلضَّرَّآءِ وَٱلْكَٰظِمِينَ ٱلْغَيْظَ وَٱلْعَافِينَ عَنِ ٱلنَّاسِ ۗ وَٱللَّهُ يُحِبُّ ٱلْمُحْسِنِينَ",
    "translation_eng": "Those who spend in the way of Allah in both ease and hardship, who control their anger, and who forgive people—Allah loves those who do good.",
    "translation_urdu":" جو لوگ آسانی میں اور  سختی  کے موقع پر بھی اللہ کے راستے میں  خرچ  کرتے ہیں ، غصّہ پینے والے اور لوگوں سے درگُزر کرنے والے ہیں ، اللہ تعالیٰ ان  نیک  کاروں سے  محبت  کرتا ہے ۔"
  },

  {
    "id": 18,
    "category": "Angry",
    "para": 18,
    "Ayatno": 63,
    "Surahno": 25,
    "surah": "Al-Furqan",
    "ayat": "وَعِبَادُ ٱلرَّحْمَـٰنِ ٱلَّذِينَ يَمْشُونَ عَلَى ٱلْأَرْضِ هَوْنًۭا وَإِذَا خَاطَبَهُمُ ٱلْجَـٰهِلُونَ قَالُوا۟ سَلَـٰمًۭا ٦٣",
    "translation_eng": "And the servants of the Most Merciful are those who walk upon the earth humbly, and when the ignorant address them (harshly), they respond with words of peace.",
    "translation_urdu": "اور رحمن کے بندے وہ ہیں جو  زمین  پر  عاجزی  سے چلتے ہیں ، اور جب جاہل لوگ ان سے ( جاہلانہ ) خطاب کرتے ہیں تو وہ سلامتی کی  بات  کہتے ہیں ۔  "
  },

  {
    "id": 19,
    "category": "Happiness",
    "para": 9,
    "Ayatno": 4,
    "Surahno": 8,
    "surah": "Al-Anfal",
    "ayat": "أُو۟لَـٰٓئِكَ هُمُ ٱلْمُؤْمِنُونَ حَقًّۭا ۚ لَّهُمْ دَرَجَـٰتٌ عِندَ رَبِّهِمْ وَمَغْفِرَةٌۭ وَرِزْقٌۭ كَرِيمٌۭ",
    "translation_eng": "These are the true believers. For them are ranks with their Lord, forgiveness, and an honorable provision.",
    "translation_urdu": "یہی لوگ سچے مومن ہیں، ان کے لیے ان کے رب کے پاس درجے ہیں، اور بخشش ہے، اور عزت والا رزق ہے۔"
  },
  {
    "id": 20,
    "category": "Happiness",
    "para": 14,
    "Ayatno": 97,
    "Surahno": 16,
    "surah": "An-Nahl",
    "ayat": "مَنْ عَمِلَ صَـٰلِحًۭا مِّن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌۭ فَلَنُحْيِيَنَّهُۥ حَيَوٰةًۭ طَيِّبَةًۭ ۖ وَلَنَجْزِيَنَّهُمْ أَجْرَهُم بِأَحْسَنِ مَا كَانُوا۟ يَعْمَلُونَ ٩٧",
    "translation_eng": "Whoever does righteous deeds, whether male or female, while being a believer, We will surely grant them a good and pure life, and We will certainly reward them according to the best of their deeds.",
    "translation_urdu":" جو شخص  نیک  عمل کرے  مرد  ہو یا  عورت  ، لیکن با ایمان ہو تو ہم اُسے یقیناً نہایت بہتر زندگی عطا فرمائیں گے اور ان کے  نیک   اعمال  کا بہتر  بدلہ  بھی انہیں ضرور ضرور دیں گے ۔"
  },
  {
    "id": 21,
    "category": "Happiness",
    "para": 11,
    "Ayatno": 62,
    "Surahno": 10,
    "surah": "An-Yunus",
    "ayat": "أَلَا إِنَّ أَوْلِيَاءَ اللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "translation_eng": "Know that the friends of Allah will have no fear, nor will they grieve.",
    "translation_urdu": "یاد رکھو کہ جو اللہ کے  دوست  ہیں ، ان کو نہ کوئی خوف ہوگا ، نہ وہ غمگین ہوں گے ۔گے۔"
  },
  {
    "id": 22,
    "category": "Happiness",
    "para": 4,
    "Ayatno": 69,
    "Surahno": 4,
    "surah": "An-Nisa ",
    "ayat": "وَمَن يُطِعِ ٱللَّهَ وَٱلرَّسُولَ فَأُوْلَـٰٓئِكَ مَعَ ٱلَّذِينَ أَنۡعَمَ ٱللَّهُ عَلَيۡهِم مِّنَ ٱلنَّبِيِّـۧنَ وَٱلصِّدِّيقِينَ وَٱلشُّهَدَآءِ وَٱلصَّـٰلِحِينَۚ وَحَسُنَ أُوْلَـٰٓئِكَ رَفِيقٗا",
    "translation_eng":"And whoever obeys Allah and His Messenger will be with those whom Allah has blessed—the prophets, the truthful, the martyrs, and the righteous. And what excellent companions they are!",
    "translation_urdu": "اور جو اللہ اور اس کے رسول کی اطاعت کرے گا، تو وہ ان لوگوں کے ساتھ ہوگا جن پر اللہ نے انعام فرمایا، یعنی انبیا، صدیقین، شہدا اور صالحین کے ساتھ، اور یہ بہترین رفیق ہیں۔"
  },

  {
    "id": 23,
    "category": "Thankful",
    "para": 2,
    "Ayatno": 152,
    "Surahno": 2,
    "surah": "Al-Baqarah",
    "ayat": "فَٱذْكُرُونِىٓ أَذْكُرْكُمْ وَٱشْكُرُوا۟ لِى وَلَا تَكْفُرُونِ",
    "translation_eng": "So remember Me; I will remember you. And be grateful to Me and do not deny Me.",
    "translation_urdu": "پس تم میرا ذکر کرو، میں تمہارا ذکر کروں گا، اور میرا شکر ادا کرو اور ناشکری نہ کرو۔"
  },
  {
    "id": 24,
    "category": "Thankful",
    "para": 14,
    "Ayatno": 7,
    "Surahno": 14,
    "surah": "Ibrahim",
    "ayat": "وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ ۖ وَلَئِن كَفَرْتُمْ إِنَّ عَذَابِى لَشَدِيدٌۭ ٧",
    "translation_eng": "And ˹remember˺ when your Lord proclaimed, ‘If you are grateful, I will certainly give you more. But if you are ungrateful, surely My punishment is severe.’”",
    "translation_urdu": "اگر تم شکر ادا کرو گے تو میں تمہیں اور زیادہ دوں گا، اور اگر ناشکری کرو گے تو میرا عذاب سخت ہے۔"
  },
  {
    "id": 25,
    "category": "Anxious",
    "para": 30,
    "Ayatno": 6,
    "Surahno": 94,
    "surah": "Ash-Sharh",
    "ayat": "إِنَّ مَعَ ٱلْعُسْرِ يُسْرًۭا",
    "translation_eng": "Indeed! With every hardship comes ease.",
    "translation_urdu": " ہر تکلیف کے بعد راحت ہے۔"
  }
]
